_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_4 (Batch (None, 30, 12)            48        
_________________________________________________________________
LSTM1 (LSTM)                 (None, 30, 32)            5760      
_________________________________________________________________
dropout_13 (Dropout)         (None, 30, 32)            0         
_________________________________________________________________
LSTM2 (LSTM)                 (None, 30, 32)            8320      
_________________________________________________________________
dropout_14 (Dropout)         (None, 30, 32)            0         
_________________________________________________________________
LSTM3 (LSTM)                 (None, 30, 32)            8320      
_________________________________________________________________
dropout_15 (Dropout)         (None, 30, 32)            0         
_________________________________________________________________
LSTM4 (LSTM)                 (None, 32)                8320      
_________________________________________________________________
dropout_16 (Dropout)         (None, 32)                0         
_________________________________________________________________
FCN1 (Dense)                 (None, 7)                 231       
=================================================================
Total params: 30,999
Trainable params: 30,975
Non-trainable params: 24
_________________________________________________________________
