_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_4 (Batch (None, 30, 12)            48        
_________________________________________________________________
LSTM1 (LSTM)                 (None, 64)                19712     
_________________________________________________________________
dropout_10 (Dropout)         (None, 64)                0         
_________________________________________________________________
FCN1 (Dense)                 (None, 32)                2080      
_________________________________________________________________
dropout_11 (Dropout)         (None, 32)                0         
_________________________________________________________________
FCN2 (Dense)                 (None, 32)                1056      
_________________________________________________________________
dropout_12 (Dropout)         (None, 32)                0         
_________________________________________________________________
FCN3 (Dense)                 (None, 7)                 231       
=================================================================
Total params: 23,127
Trainable params: 23,103
Non-trainable params: 24
_________________________________________________________________
